"investigation_type":"Nucleic Acid Sequence Report is the root element of all MIGS/MIMS compliant reports as standardized by Genomic Standards Consortium. This is a controlled vocabulary. The possible terms are: eukaryote (for eukaryotic genomes or transcriptomes), bacteria_archaea (for bacterial or archaeal genomes/transcriptomes), virus (for viral DNA or RNA), plasmid, organelle, metagenome (for whole-community metagenomes or metatranscriptomes), mimarks-survey (for marker genes from a community or environmental sample), or mimarks-specimen (for marker genes from a single organism)",
"env_package":"Environment from which the sample was obtained. This is a controlled vocabulary, and the possible terms are: air, built environment, host-associated, human-associated, human-skin, human-oral, human-gut, human-vaginal, microbial mat/biofilm, misc environment, plant-associated, sediment, soil, wastewater/sludge, water.",
"library_source":"The LIBRARY_SOURCE specifies the type of source material that is being sequenced. This is a controlled vocabulary, with the possible values: genomic, metagenomic, metatranscriptomic, transcriptomic, synthetic, viral RNA, or other.",
"study_type":"The type of study conducted. This field is a controlled vocabulary for the Sequence Read Archive (SRA).",
"library_strategy":"Sequencing technique intended for this library. Controlled vocabulary for the Sequence Read Archive (SRA): WGS (Random sequencing of the whole genome), WGA (whole genome amplification to replace some instances of RANDOM), WXS (Random sequencing of exonic regions selected from the genome), RNA-Seq (Random sequencing of whole transcriptome), miRNA-Seq (for micro RNA and other small non-coding RNA sequencing), ncRNA-Seq(Non-coding RNA), WCS (Random sequencing of a whole chromosome or other replicon isolated from a genome), CLONE (Genomic clone based (hierarchical) sequencing), POOLCLONE (Shotgun of pooled clones (usually BACs and Fosmids)), AMPLICON (Sequencing of overlapping or distinct PCR or RT-PCR products), CLONEEND (Clone end (5', 3', or both) sequencing), FINISHING (Sequencing intended to finish (close) gaps in existing coverage), ChIP-Seq (Direct sequencing of chromatin immunoprecipitates), MNase-Seq (Direct sequencing following MNase digestion), DNase-Hypersensitivity (Sequencing of hypersensitive sites, or segments of open chromatin that are more readily cleaved by DNaseI), Bisulfite-Seq (Sequencing following treatment of DNA with bisulfite to convert cytosine residues to uracil depending on methylation status), EST (Single pass sequencing of cDNA templates), FL-cDNA (Full-length sequencing of cDNA templates), CTS (Concatenated Tag Sequencing), MRE-Seq (Methylation-Sensitive Restriction Enzyme Sequencing strategy), MeDIP-Seq (Methylated DNA Immunoprecipitation Sequencing strategy), MBD-Seq (Direct sequencing of methylated fractions sequencing strategy), Tn-Seq (for gene fitness determination through transposon seeding), VALIDATION (CGHub special request: Independent experiment to re-evaluate putative variants., Micro RNA (sequencing strategy designed to capturepost-transcriptional RNA elements and include non-coding functional elements), FAIRE-seq (Formaldehyde-Assisted Isolation of Regulatory Elements), SELEX (Systematic Evolution of Ligands by EXponential enrichment (SELEX) is an in vitro strategy to analyze RNA sequences that perform an activity of interest, most commonly high affinity binding to a ligand), RIP-Seq (Direct sequencing of RNA immunoprecipitates (includes CLIP-Seq, HITS-CLIP and PAR-CLI)), ChiA-PET (Direct sequencing of proximity-ligated chromatin immunoprecipitates), RAD-Seq (Restriction site Associated DNA Sequencing is a method for sampling the genomes of multiple individuals in a population using NGS), OTHER",
"library_screening_strategy":"Specific enrichment or screening methods applied before and/or after creating clone libraries in order to select a specific group of sequences. Equivalent to the SRA field library_strategy, which is defined by the SRA as: 'Whether any method was used to select for or against, enrich, or screen the material being sequenced.'",
"library_construction_method":"Library construction method used for clone libraries. Controlled vocabulary, with values either 'single' or 'paired'. Equivalent of the SRA LIBRARY_LAYOUT field, which is defined as: 'specifies whether to expect single, paired, or other configuration of reads.' ",
"sequencing_method":"Sequencing platform used for sequencing. Equivalent to the SRA 'Platform' field. In the SRA, this is a controlled vocabulary, with the possible values: LS454, Illumina, Complete Genomics, Pacbio Smrt, Ion Torrent, Oxford Nanopore, or Capillary.",
"instrument_model":"Model of instrument used for sequencing. In the SRA, each sequencing method (platform) has a separate controlled vocabulary. For a complete list of possible values, see the submission guide here: http://www.ebi.ac.uk/ena/submit/preparing-xmls#experiment",
"avg_read_length":"Average number of nucleotides per sequencing read. This value is calculated by MetaSeek as the total number of bases divided by the total reads sequenced (also accounting for whether single or paired-end sequencing was conducted)",
"percent_gc":"Percent of G or C nucleotides sequenced out of the total nucleotides sequenced. This is a value calculated by MetaSeek as the total count of G and C nucleotides divided by the total count of A, C, G, and T nucleotides (excluding unidentified N nucleotides)",
"library_reads_sequenced":"Total number of reads sequenced. This is equivalent to the MIxS 'library reads sequenced' field, or the SRA's 'total spots' field.",
"env_biome":"Biome should be treated as the descriptor of the broad ecological context of a sample. They should be drawn from the EnvO ontology (see terms here: http://bioportal.bioontology.org/ontologies/ENVO/?p=classes&conceptid=http://purl.obolibrary.org/obo/ENVO_00000428). Biomes are defined based on factors such as plant structures, leaf types, plant spacing, and other factors like climate. Examples include: desert, taiga, deciduous woodland, or coral reef. EnvO (v 2013-06-14) terms can also be found via the link: www.environmentontology.org/Browse-EnvO",
"env_feature":"Compared to biome, feature is a descriptor of the more local environment. Environmental feature level includes geographic environmental features. They should be drawn from the EnvO ontology (see terms here: http://bioportal.bioontology.org/ontologies/ENVO/?p=classes&conceptid=http://purl.obolibrary.org/obo/ENVO_00002297), Examples include: harbor, cliff, or lake. EnvO (v 2013-06-14) terms can also be found via the link: www.environmentontology.org/Browse-EnvO.",
"env_material":"The environmental material level refers to the material that was displaced by the sample, or material in which a sample was embedded, prior to the sampling event. Environmental material terms are generally mass nouns. Terms should be drawn from the EnvO ontology (see terms here: http://bioportal.bioontology.org/ontologies/ENVO/?p=classes&conceptid=http://purl.obolibrary.org/obo/ENVO_00010483). Examples include: air, soil, or water. EnvO (v 2013-06-14) terms can be found via the link: www.environmentontology.org/Browse-EnvO",
"geo_loc_name":"The geographical origin of the sample as defined by the country or sea name followed by specific region name. Country or sea names should be chosen from the INSDC country list (http://insdc.org/country.html), or the GAZ ontology (v 1.512) (http://purl.bioontology.org/ontology/GAZ)."