{"Identifiers & Links":{
  "db_source_uid":"The unique ID (UID) for the SRA source database (can be used for eutilities queries)",
  "db_source":"The source database the metadata was scraped from (currently, all datasets are from the SRA)",
  "expt_id":"The experiment id, beginning SRX, ERX, or DRX",
  "expt_link":"URL to the experiment webpage (SRX/ERX/DRX#), e.g. https://www.ncbi.nlm.nih.gov/sra/4084278",
  "study_id":"SRA project accession ID for the project encompassing this dataset. Begins SRP, ERP, or DRP",
  "sample_id":"SRA sample accession ID. Begins with SRS, ERS, DRS",
  "bioproject_id":"BioProject accession ID for the project encompassing this dataset. Begins PRJ",
  "biosample_id":"BioSample accession ID for the BioSample associated with this SRA sample. Begins SAMN",
  "biosample_uid":"Unique identifier (UID) for the BioSample database. This UID can be used in the NCBI's eutilities tool",
  "biosample_link":"URL to the corresponding BioSample webpage for this dataset"
  },
  "Submission Information":{
    "submission_id":"The submission accession ID for the SRA database, beginning SRA,ERA, or DRA",
    "organization_name":"Name of submitter or submitter organization",
    "organization_address":"Address of submitter or submitter organization",
    "organization_contacts":"Contact names and emails for submitter/s or submitter organization",
    "metadata_publication_date":"Date the sample metadata associated with this dataset was published on the BioSample database",
    "date_scraped":"Date dataset was added to MeetaSeek. This is a Datetime field"
  },
  "Sequencing Information":{
    "library_name":"Free text name of the sequencing library",
    "library_strategy":"The sequencing technique intended for the library (an SRA mandatory field with a controlled vocabulary)",
    "library_source":"The type of source material that is being sequenced (an SRA mandatory field with a controlled vocabulary)",
    "library_screening_strategy":"The method used to select and/or enrich the material being sequenced (an SRA mandatory field with a controlled vocabulary); field is called 'library selection' in the SRA database",
    "library_construction_method":"Whether sequencing is single- or paired-end sequencing (or vector). Value is either 'single' or 'paired' (an SRA mandatory field with an controlled vocabulary)",
    "library_construction_protocol":"Free text description how sequences were produced (submitter provided)",
    "sequencing_method":"Sequencing platform used for sequencing; field is called 'platform' in SRA database. A MetaSeek-parsed field, which constrains free text to the controlled vocabulary specified by the SRA, is available in the 'metaseek_sequencing_method' field",
    "metaseek_sequencing_method":"The sequencing method used for sequencing this dataset, constrained to the controlled vocabulary specified by the SRA. This is a MetaSeek-parsed field which constrains e.g. submitter typos of capitalization/vocabulary variation to a common controlled vocabulary",
    "instrument_model":"Model of sequencing instrument (an SRA mandatory field with a controlled vocabulary)",
    "num_runs_in_accession":"The number of sequencing runs available for this dataset. If this number is more than one, sequencing statistic fields such as the average read length refer to the run with the highest number of total reads sequenced",
    "run_ids_maxrun":"Sequencing run accession ID. Begins SRR, ERR, or DRR. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "library_reads_sequenced_maxrun":"Total number of reads sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "total_num_bases_maxrun":"Total number of bases sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "download_size_maxrun":"File download size, in bytes. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "avg_read_length_maxrun":"Average read length of sequencing reads. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "baseA_count_maxrun":"Number of A/adenine nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "baseC_count_maxrun":"Number of C/cytosine nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "baseG_count_maxrun":"Number of G/guanine nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "baseT_count_maxrun":"Number of T/thymine nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "baseN_count_maxrun":"Number of undetermined nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "gc_percent_maxrun":"Percent of GC nucleotides sequenced. If the num_runs_in_accession is greater than one, refers to the run with the highest number of total reads sequenced",
    "run_quality_counts_maxrun":"Histogram statistics of the number of nucleotides with quality score ranges. Dictionary-like, with the key:value format of 'quality score:count of bases'"
  },
  "Experiment Details":{
    "expt_title":"Free text title of the experiment (submitter provided)",
    "expt_design_description":"Free text description of experimental design (submitter provided)",
    "experimental_factor":"Experimental factor or treatment applied in the experiment that produced this dataset. This is a submitter-provided free text field. Use of terms in the EFO ontology (https://www.ebi.ac.uk/efo/) is encouraged"
  },
  "Study Details":{
    "study_title":"Free text title of project encompassing this dataset (submitter provided)",
    "study_type":"The type of sequencing study. This is a mandatory SRA field with a controlled vocabulary",
    "study_type_other":"Free text description of the study type if the study_type selected is 'Other'",
    "study_abstract":"Free text detailed description of study akin to a publication abstract",
    "study_links":"Any links (URLs) relevant to the dataset. A text field in dictionary-like form, of the format 'URL description:URL link'",
    "study_attributes":"Submitter-provided list of attributes relevant to the study. Attributes can A text field in dictionary-like form, of the format 'attribute:attribute value'. Both the attributes and their values are dictated by the user and can be any field relevant to their study",
    "project_name":"The name of the project within which the dataset was created. This is a MIxS mandatory field. This field is encouraged by the SRA but not enforced, so many datasets are missing this value. In practice, the field study_title is more complete because it is mandatory for BioProject submission, and we recommend filtering on study_title rather than project_name"
  },
  "Environmental/Contextual/Sample Information":{
    "sample_title":"Free text title of the sample",
    "sample_description":"Free text description of the sample from which the dataset originated (submitter provided)",
    "biosample_package":"The BioSample package that represents the type of BioSample from which the dataset is derived. This is a mandatory field in the SRA with a controlled vocabulary. BioSample packages are defined by the NCBI, and modeled after the MIxS metadata standards: https://www.ncbi.nlm.nih.gov/biosample/docs/packages/ ",
    "biosample_models":"The generic BioSample package/s associated with this dataset. For the most part, this field is redundant with biosample_package (but does not specify the package version as does the biosample_package), and we recommend filtering on biosample_package rather than biosample_models",
    "sample_attributes":"Any additional relevant attributes that describe the sample from which this dataset is derived, and their attribute values. Both the relevant attributes and their values are specified by the submitter, and which attributes are relevant are left to the submitter to decide. This is a dictionary-like free text field, with the format 'attribute:value'. Submitters are encouraged to use MIxS metadata standard fields, but this is not enforced",
    "investigation_type":"The type of sequencing sample of the dataset. This is a MIxS standard mandatory field with a controlled vocabulary. Investigation type is the root element for all MIxS-compliant metadata. This field is encouraged by the SRA but not enforced, so many datasets are missing this value. The closest analogs to this field that are SRA mandatory fields are a combination of library_source and library_strategy. A MetaSeek-predicted field, 'metaseek_investigation_type', is available which fills the gaps where this field is not provided by submitters",
    "metaseek_investigation_type":"MetaSeek-predicted field of the MIxS-compliant investigation type of this sequence. This field is predicted from other fully available fields in the SRA database in order to fill the gaps where the investeigation_type field is not provided by users. On the Explore page, the 'Investigation Type' filter uses this field by default. If this field is filtered on (in the Explore page or API), a P value cutoff of 0.9 is used by default - this P value is stored in the field 'metaseek_investigation_type_P'",
    "metaseek_investigation_type_P":"The P-value confidence of prediction for the metaseek_investigation_type field. If no filter is used for this field, a P-value cutoff of 0.9 is used by default. A P-value of 1 is indicated where the MIxS-compliant investigation_type could be parsed directly from submitter-provided metadata",
    "metaseek_mixs_specification":"MetaSeek-predicted field for the root MIxS specification of either MIGS, MIMS, or MIMARKS. If you filter on this field, a default P value of 0.9 is used as a cutoff ",
    "metaseek_mixs_specification_P":"The P-value confidence of prediction of the metaseek_mixs_specification field. If no filter is specified, a P-value cutoff of 0.9 is used by default. A P-value of 1 is indicated where the MIxS-compliant MIxS specification could be parsed directly from submitter-provided metadata",
    "env_package":"Environment from which the sample was obtained. This is a MIxS standard mandatory field with a controlled vocabulary, but is a submitter-provided free text field. A MetaSeek-parsed field, which constrains free text to the controlled vocabulary specified by the MIxS standards, is available in the 'metaseek_env_package' field. This field is encouraged by the SRA but not enforced, so many datasets are missing this value",
    "metaseek_env_package":"The MIxS-compliant environmental package associated with the dataset, constrained to the controlled vocabulary specified by the MIxS standards. This is a MetaSeek-parsed field which constrains e.g. submitter typos or capitalization/vocabulary variation to a common controlled vocabulary",
    "lat_lon":"The latitude and longitude origin of the sample. This is a MIxS standard mandatory field. The values reported are provided by the submitter as free text, and are *supposed* to be in decimal degrees and in the WGS84 system. MetaSeek parses this (and the fields 'latitude' and 'longitude' which are also free text fields) into a numeric lat and lon value which are stored in the fields 'meta_latitude' and 'meta_longitude'. We recommend filtering on the meta_latitude and meta_longitude fields (this is the default on the Explore page)",
    "latitude":"Free text field of latitude provided by submitter. MetaSeek parses this (and the fields 'lat_lon' and 'longitude' which are also free text fields) into a numeric lat and lon value which are stored in the fields 'meta_latitude' and 'meta_longitude'. We recommend filtering on the meta_latitude and meta_longitude fields (this is the default on the Explore page)",
    "longitude":"Free text field of longitude provided by submitter. MetaSeek parses this (and the fields 'latitude' and 'longitude' which are also free text fields) into a numeric lat and lon value which are stored in the fields 'meta_latitude' and 'meta_longitude'. We recommend filtering on the meta_latitude and meta_longitude fields (this is the default on the Explore page)",
    "meta_latitude":"MetaSeek-parsed latitude, provided as a numeric value in decimal degrees (positive for N hemisphere, negative for S hemisphere). Parsed from free text fields 'lat_lon', 'latitude', and 'longitude'",
    "meta_longitude":"MetaSeek-parsed longitude, provided as a numeric value in decimal degrees (positive for E hemisphere, negative for W hemisphere). Parsed from free text fields 'lat_lon', 'latitude', and 'longitude'",
    "geo_loc_name":"The geographic origin of the sample as defined by the country or sea name followed by specific region name. This is a MIxS standard mandatory field and is provided as free text by the submitter. Country or sea names should be chosen from the INSDC country list (http://insdc.org/country.html), or the GAZ ontology (v1.446) (http://purl.bioontology.org/ontology/GAZ)",
    "collection_date":"The time of sampling, either as an instance (single point in time) or an interval. This is a MIxS standard mandatory field. This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many datasets are missing this value",
    "env_biome":"The environmental biome from which the dataset originated. This is a MIxS standard mandatory field. This value should be chosen from the EnvO ontology (v1.53) (http://www.environmentontology.org/Browse-EnvO). The environmental biome are the major classes of ecologically similar communities of plants, animals, and other organisms (e.g. desert, taiga, deciduous woodland, coral reef). MIxS mandatory fields are encouraged by the SRA but not required, so many datasets are missing this value",
    "env_feature":"The environmental feature from which the dataset originated. This is a MIxS standard mandatory field. This value should be chosen from the EnvO ontology (v1.53) (http://www.environmentontology.org/Browse-EnvO). The environmental feature includes geographic features characterizing the environment/origin of the sample (e.g. harbor, cliff, lake). MIxS mandatory fields are encouraged by the SRA but not required, so many datasets are missing this value",
    "env_material":"The environmental material from which the dataset originated. This is a MIxS standard mandatory field. This value should be chosen from the EnvO ontology (v1.53) (http://www.environmentontology.org/Browse-EnvO). The environmental material refers to the matter that was displaced by the sample, prior to the sampling event (e.g. air, soil, water).MIxS mandatory fields are encouraged by the SRA but not required, so many datasets are missing this value",
    "depth":"The vertical distance below surface from which the dataset was sampled. This is a MIxS standard mandatory field for the 'sediment', 'soil','microbial mat/biofilm', and 'water' environmental packages. It is a submitter-provided free text field, so conventions and units are inconsistent and numerically filtering on this parameter is not possible (e.g. '~10m', '{0-0.15}', and 'water surface' are all valid entries). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "elevation":"The elevation of the sampling site from which this dataset originated, as measured by the vertical distance from mean sea level. This is a MIxS standard mandatory field for the 'sediment','soil', and 'microbial mat/biofilm' environmental packages. It is a submitter-provided free text field, so conventions and units are inconsistent and numerically filtering on this parameter is not possible (e.g. '158m NN', '-20m', and '490 m a.s.l.' are all valid entries). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "altitude":"The vertical distance between Earth's surface above sea level and the sampled position in the air. This is a MIxS standard mandatory field for the 'air' environmental package. It is a submitter-provided free text field, so conventions and units are inconsistent and numerically filtering on this parameter is not possible (e.g. '~sea level', 'sA1', and 'high' are all entries that exist in the MetaSeek database). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "specific_host":"Host species for the organism/community that was sequenced. This is a submitter-provided free text field (the scientific name, common name/s, or the NCBI taxonomy ID for the host species are typical entries, but other free text entries are common)",
    "tissue":"Tissue material the initial sample was taken from. This is a submitter-provided free text field",
    "sex":"Sex of subject that was sequenced. This is a submitter-provided free text field",
    "sample_type":"A free text field describing the type of sample being sequenced",
    "age":"Age of the subject being sequenced",
    "dev_stage":"Developmental stage of the sample being sequenced",
    "host_disease":"Disease of the host from which the dataset was sourced"
  },
  "Genome Details":{
    "ncbi_taxon_id":"unique taxon id from NCBI Taxonomy database (see https://www.ncbi.nlm.nih.gov/taxonomy)",
    "taxon_scientific_name":"The scientific name of the NCBI taxon (e.g. 'human gut metagenome' or 'Saccharomyces cerevisiae')",
    "taxon_common_name":"A common name of the NCBI taxon (e.g. 'Asiatic elephant' or 'baker's yeast')",
    "subspecific_genetic_lineage":"The strain, cultivar, breed, etc. of the organism that was sequenced. This is a submitter-provided free text field",
    "ploidy":"The ploidy level of the genome being sequenced (e.g. allopolyploid, haploid, diploid). This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). Terms listed under class 'ploidy' (PATO:001374) of the PATO ontology (v1.269) should be chosen (http://purl.bioontology.org/ontology/PATO). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "num_replicons":"In eukaryotes, the number of replicons in a nuclear genome of eukaryotes; In bacteria/archaea, the number of replicons of the genome; In segmented viruses, the number of segments. Always applied to the haploid chromosome count of a eukaryote. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field (an integer or 'unknown' are common entries). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "estimated_size":"The estimated size of the genome prior to sequencing. Of particular importance in the sequencing of (eukaryotic) genome which could remain in draft form for a long or unspecified period. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field (e.g. '350Mb', 'unknown', and '600 Mbps' are all valid entries). MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "ref_biomaterial":"Primary publication if isolated before genome publication; otherwise, primary genome report. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "propagation":"How the organism being sequenced propagates. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). For phages, this value should be either 'lytic' or 'lysogenic'; for plasmids, this should specify incompatibility group. This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "assembly":"How the genomic assembly was done (e.g. with a text based assembler or flowgram assembler); estimated error rate associated with the finished sequences (e.g. error rate of 1 in 1000 bp); and the method of calculation. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "finishing_strategy":"Whether the genome project intended to produce a complete or draft genome; coverage, the fold coverage of the sequencing expressed as 2x, 18x, etc.; and how many contigs were produced for the genome. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "isol_growth_condt":"Publication reference in the form of pubmed ID (PMID), DOI, or URL for the isolation and growth condition specifications of the organism/material. This is a MIxS standard mandatory field for all MIGS investigation types (eukaryote, bacteria, virus, plasmid, and organelle). This is a submitter-provided free text field. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "biomaterial_provider":"Provider of the biomaterial source (e.g. commercial cell line provider)"
  },
  "Marker Gene Details":{
    "target_gene":"The gene being targeted in a marker gene investigation (MIMARKS-survey or MIMARKS-specimen). This is a MIxS standard mandatory field for the MIMARKS-survey or MIMARKS-speciment investigation types. This is a submitter-provided free text field, so multiple representations of the same target gene by different submitters are possible. MIxS mandatory fields are encouraged by the SRA but not required, so many relevant datasets are missing this value",
    "target_subfragment":"The subfragment of the target_gene being targeted (e.g. the v4v6 region of the 16S gene)"
  }
}
